{
  "version": "1.0",
  "provider_name": "Jayant's Clipboard",
  "provider_url": "https://jayant.dev",
  "author_name": "Jayant Bhawal",
  "author_url": "http://jayantbhawal.in/",
  "title": "Data protection measures that you can employ today easily, and for free!",
  "type": "link",
  "html": "<p>Hello, world!</p><p>Recently, my residential society ran a COVID vaccination drive and requested the phone numbers from all residents who wanted to get themselves vaccinated. Later, they shared a neat little spreadsheet with everyone in the society so everyone had confirmation about their own statuses regarding confirmation of a vaccination slot.</p><p>This spreadsheet had the exact apartment number, phone number, and full name of everyone who registered.</p><p>If this doesn't seem like an issue to you, I have a post to link you to, and please continue reading the article right after the box.</p>My approach to data privacy\n\n<hr><p>If you already see an issue here, then you're probably here for the tips. In any case, skip to right after the following lecture.</p><h2>Why is this a big deal?</h2><p>Ever wondered how all kinds of new spammers keep getting your phone numbers? How does some random person in some call center manage to call you and ask if you want insurance for the car that you wanted but didn't buy yet? Or how someone calls you asking if you would like to join a weight loss program, even though you aren't really interested in even joining a gym?</p><p>OR, you've probably gotten this call.</p><blockquote><p>\"Sir, would you like a pre-approved credit card?\"</p></blockquote><p>Turns out, when you use a service, be it a restaurant, a shop, or any online service that requires you to provide your email or phone number, you're not just paying with money for those services. You're also paying with your hours of peace of mind, uninterrupted sleep, and just the right to not be disturbed at random hours. Your data either gets sold, or stolen/hacked sooner or later.</p><p>Also, once your data is out there, it's out there forever. Till you choose to change your number, and email, it will always be out there.</p><p>The scary thing about this is most people including myself will gradually keep releasing more and more info about ourselves over time, some of it being private and unintentional, and a lot of it completely intentional and often necessary. All this data can be pieced together to build a dataset about you that can probably do a pretty good job at answering questions about you that even you didn't think of the answers to.</p><p>Consider this:</p><ul><li>You ordered something on Dominoes. You used your email. Let&#x27;s say your phone\nnumber wasn&#x27;t needed.</li><li>Dominoes got hacked.<strong> Your email was leaked.</strong> Along with your eating/ordering patterns, and an\nestimate of your spending power.</li><li>You got a hotel reservation. You had to provide your email and phone number.\nLikely even some form of National ID.</li><li>Of course, the hotel sells the data of you and everyone else who stayed that\nmonth. The data sold might also include how many people stayed, whether you\nwere married, and how much you could pay for rooms and services.</li></ul><p>Now your email, phone, national ID, eating patterns, spending power, and more are out there, with someone interested enough in gathering all this because there are enough of those willing to pay good money for this.</p><p>And, there are so many more ways for you to release so much of your info that you'd prefer keep away from the hands of those who should have nothing to do with it.</p><p>So, why is this a big deal?</p><p>What if a health insurance provider decides to run a check on you and decides to decline you coverage because you used to eat a lot of pizza a few years ago, even though it doesn't significantly impact your current health conditions? Or, maybe just offer you increased premiums because of the fact?</p><p>What if when you try and buy an apartment, the builder/owner runs a check on you, determine that you're fairly well off compared to the average prospect, and raise the prices just for you?</p><p>An unintended party having access to your real-life identifiable data has strong real-life consequences.</p><h2>What can I do?</h2><p>This will only cover things that you can start doing from today, and that cost you no money to do, and not require being technologically adept.</p><p>Keep in mind that there will be times when it's too difficult or inconvenient to follow these measures, so, take your best judgement in that case. My own data is probably in a million unintended hands already.</p><ol><li>Refuse to share phone numbers or emails at shops, restaurants, hospitals, etc.<ol><li>If it&#x27;s unavoidable, and if you must share a fake number, try and ensure\nthat it is indeed a defunct number. Accidentally sharing a number that you\nbelieve is fake, but does belong to someone else just makes another poor\nperson suffer unwanted spam. <strong>Note, that it&#x27;s inadvisable</strong> to use a fake\nnumber anyway because sooner or later it could be in use by another\nperson.</li><li>If you must share a working number, consider using a single phone number\nevery time that you don&#x27;t use often, ideally one that&#x27;s not tied to any\nother important services (such as insurance or employment).</li></ol></li><li>When making a payment, try to operate the POS machine yourself. It&#x27;s pretty straight-forward, the instructions are right there on the screen. OR, use a contactless card.</li><li>When sharing your national ID, offer an obfuscated copy of your ID if possible.<ol><li>In India, the UIDAI website allows you to download a copy of your AADHAR\nCard with the first 8 digits replaced with an <code>X</code>. This copy is perfectly\nacceptable for basically any purpose that needs it. Though, there are\nenough issues on the government side of Aadhar anyway.\nsource 1,\nsource 2\n(links from 2018)</li><li>If you only have a\nnon-obfuscated copy,\nyou can use either a marker to hide the first 8 digits on a print copy, or\na photo editing tool on your device to hide the first 8 digits.</li></ol></li><li>When using an app that asks for permissions like contacts, location, or camera, think about why this app might need these permissions.<ol><li><p>If you can't get a good answer by yourself or from someone else, reconsider if you really need this app.</p></li><li><p>If you do really need this app and you could not use it if you try to deny permissions, try this:</p><ol><li><p>Grant the permission. This should let you past the initial screen that prevents you from accessing the rest of the app.</p></li><li><p>Open App Info. That should let you review the permissions of the app (along with letting you force stop it, or uninstall).</p></li><li><p>Disable the allowed permissions.</p></li><li><p>Go back to the app. In many cases, this works without issues. And the app may not ask for permissions again. But if the app becomes difficult to use now, you really have to consider how important this app is to you.</p></li></ol></li></ol></li><li>When making an online payment, consider using a credit card.<ol><li>A credit card has an upper limit on how much money can be used from it\nevery month, unlike a debit card where there might be a daily limit, but\nif you somehow notice your card after it&#x27;s lost for too long, your entire\naccount could be drained.</li><li>Plus, credit cards often make it pretty easy to request chargebacks,\nespecially in the case of fraud. Chargebacks are possible on debit cards\ntoo, but it&#x27;s generally a much better experience with credit cards.\nsource 1,\nsource 2</li><li>I personally think that indirect payment services are a pretty great\noption too. Such as PayPal, or Amazon Pay, if the service accepts it. The\nbenefit being, that if you use these services to make a payment on 10\ndifferent sites instead of your CC, then you don&#x27;t have to worry about\nyour card getting leaked when one of those 10 sites eventually gets\nhacked. You only have to worry about PayPal or Amazon screwing something\nup or being malicious. I&#x27;d say being at risk from 2 sources is much better\nthan being at risk from 10 sources.</li></ol></li></ol><hr><p>I'll keep updating this list with ideas, but you're welcome to share more with me on Twitter (link below).</p>",
  "thumbnail_url": "https://jayant.dev/static/ce5fe5fad9a888af8b42f6eda28cfb12/db8a11a8-2209-5ec3-8aec-3d536fdd0add.png",
  "thumbnail_width": 1200,
  "thumbnail_height": 630
}