{
  "version": "1.0",
  "provider_name": "Jayant's Clipboard",
  "provider_url": "https://jayant.dev",
  "author_name": "Jayant Bhawal",
  "author_url": "http://jayantbhawal.in/",
  "title": "Getting you interested in Framer Motion with the essentials",
  "type": "link",
  "html": "\n\n[code snippet, view page to see]\n\nA crude little SVG animation using framer motion\n\nThis animation you see here could be very easily done using plain JS, so maybe it doesn&#x27;t do the best job of showing why you should add 32kBs extra to your bundle size delivered over the network. But, look at how easy this was to achieve!\n\n<p>Here's how the actual component looks like, roughly</p>\n\n[code snippet, view page to see]\n\n<p>Framer Motion is a high level UI animations library that makes a LOT of animations use-cases extremely simple. It even offers a really simple way to even use shared element transitions! See my experiment with no libraries, here, and the code here.</p><p>Now, this isn't a tutorial, this is just something to get you interested with examples that you can implement in most apps.</p><hr><p>Following is a list of things you can do, and remember, for code examples, find this file on Github and look at the relevant imported components.</p><h2>1. Circular progress bars</h2><p>This is the first one you would have noticed, and it's present only on this page because I don't really want it to be a site-wide thing.</p><p>Progress bars are a ubiquitous thing, essential to letting a user know how much of a certain process has been completed so far. Unlike a loading indicator, a progress bar allows a user a sense of how much time is left for a process or task to complete. Now, rectangular progress bars are pretty straight forward. You can take a div inside another div and make the inner div have X% width relative to the outer one. Throw in some styling and you have a basic progress bar.</p><p>Circular progress bars can offer a nicer experience in some cases, and they don't take up as much horizontal space which means more of them can be stacked horizontally. But since it could be particularly complex to get a partial circle, because regular elements don't allow you to have a specific length on a border, you may be able to get 25/50/75/100% indications, but for finer control, you neen the SVG circle shape.</p><p>Here's an example of a circular progress bar to show your scroll progress through the page. This progress bar is present on only this page on this site, so if this annoys you, click on \"Show Editor\", then in the Preview section, click on \"Hide scroll progress\".</p>\n\n[code snippet, view page to see]\n\n[code snippet, view page to see]\n\n<h2>2. Animated list items</h2><p>Animating list items isn't a complex feat to achieve in any library, but prepare to have your mind blown at how easy it is here. Animating items in a list could be a great way to render items in a navbar, products list, users list, etc. It ideally shouldn't be used in situations where getting to the data asap is more important than fanciness, such as real-time metrics in a logs dashboard.</p><p>We have two examples here. The first one is well suited for static lists, such as a list of options/settings or menu items, things that are unlikely to change during a session. The second one is well suited for larger lists, where you may have infinite scrolling in place to fetch even more items.</p>\n\n[code snippet, view page to see]\n\n[code snippet, view page to see]\n\n<h2>3. Lightboxing</h2><p>Did you try out the \"maximize\" button on the live code editors on this page yet? The lightbox functionality is powered by Framer Motion too! To see how exactly the code lightbox works, you'll have to check Github again.</p><p>Lightboxing is a great way to show specific content by using the entire screen, without taking the user to a new page. Now, if you could introduce an animation such that the image/content could grow from its current position to fill the whole screen and then go back to where it's supposed to be, it offers a really great experience of being tethered to the rest of the content on the page.</p><p>The below example will cover a lightweight version of a lightbox, using an image example.</p>\n\n[code snippet, view page to see]\n\n<h3>There will be more stuff here, such as image gallery/carousel, toasts, expanding content cards, maybe more.</h3><p>To be continued.</p>"
}