{
  "version": "1.0",
  "provider_name": "Jayant's Clipboard",
  "provider_url": "https://jayant.dev",
  "author_name": "Jayant Bhawal",
  "author_url": "http://jayantbhawal.in/",
  "title": "Windows Powertoys - Did you know it was a thing?",
  "type": "link",
  "html": "<p>Recently I discovered PowerToys. If you don't know about this, then congratulations because you should totally install this right now. It surely has something you can make use of!</p><p>PowerToys is basically a set of tools that are nice-to-haves for most people. It's things like a Color Picker, Window Zones, Spotlight (from MacOS), Bulk Rename, etc. As of this date, there are 9 tools in total.</p><details><summary>Click to see the list of all the tools</summary><div style=\"padding-left:1em\"><details><summary>Color Picker</summary>Literally a system-wide color picker that supports Hex, RGB, and HSL!\n\n[images, view page to see]\n\n</details><details><summary>Fancy Zones</summary>Windows already had some seriously solid window tiling, but fancy zones takes it to the next level!\n\n[images, view page to see]\n\n</details><details><summary>File Explorer add-ons (Preview Pane)</summary>Now you can preview SVGs and Markdown files in the preview pane!\n\n[images, view page to see]\n\n</details><details><summary>Image Resizer</summary>Bulk Image resizing. It&#x27;s not something I would use often, but there have been times when I had to use [IrfanView](https://www.irfanview.com/) to achieve this functionality.\n\n[images, view page to see]\n\n</details><details><summary>Keyboard Manager</summary>I&#x27;ll probably not use this much either, but again, it&#x27;s a great feature by itself!\n\n[images, view page to see]\n\n</details><details><summary>Power Rename</summary>There were a few times when I had to use third-party tools to do this.\n\n[images, view page to see]\n\n</details><details><summary>PowerToys Run (Spotlight)</summary>SO MUCH YES! This is basically MacOS&#x27;s Spotlight, though slightly limited in functionality. But this is so good nonetheless!\n\n[images, view page to see]\n\n</details><details><summary>Shortcut Guide</summary>It&#x27;s useful sometimes... sometimes.\n\n[images, view page to see]\n\n</details><details><summary>Video Conference Mute</summary>I guess it&#x27;s handy if you can&#x27;t disable mic/cam by other means.\n\n[images, view page to see]\n\n</details></div></details><p>My favorites are Fancy Zones, and PowerToys Run.</p><p>Fancy Zones allows me to create custom layout grids that I can snap windows to using hotkeys (Win + Left/Right). It's exceptionally useful when I want a dashboard like setup going on with multiple windows. For example: I'm writing some code, but I don't need the whole screen for that. So the top half of the remaining half of the screen is taken up by Slack, and the bottom half by Discord or something!</p>\n\n[images, view page to see]\n\n<p>PowerToys Run is just so good for when I want to launch an app, or do quick math. I don't need to pin a dozen things to my taskbar anymore, or find an icon on the desktop, or start menu. You know, basically do Spotlight things!</p><p>I can't however, do currency conversions in it yet.</p>\n\n[images, view page to see]\n\n<p>Here's the link to the releases page if you're interested!</p>"
}